app/controllers/diaries_controller.rb

  def index
    @find = if user = User.find_by_alias(params[:user_id])
              user
            else
              Team.find_by_alias(params[:team_id])
            end
    @page = if params[:page] == 0 || params[:page].nil?
              params[:page] = 1
            elsif params[:page].grep(/[^0-9]/)
              params[:page] = 1
            else
              params[:page]
            end
    @diaries = @find.diaries.find(:all, :order => 'created_at DESC', :limit => @page*5)
---
SELECT count(*) AS count_all FROM "diaries" WHERE ("diaries".user_id = 2)