app/controllers/diaries_controller.rb

  def index
    @diaries = User.find_by_alias(params[:user_id])
    @diaries = @diaries.diaries.find(:all, :order => 'created_at DESC')
---
SELECT * FROM "users" WHERE ("users"."alias" = 'asdflkjasfkljasf') LIMIT 1
SELECT * FROM "diaries" WHERE ("diaries".user_id = 1) ORDER BY created_at DESC

  def show
    if @team = Team.find_by_alias(params[:id])
      @diaries = @team.user.find_by_alias(params[:user_id]).diaries
      @diaries = @diaries.find(:all, :conditions => {:team_id => @team.id},
                              :order => 'created_at DESC')
---
SELECT * FROM "teams" WHERE ("teams"."alias" = 'hello') LIMIT 1
SELECT "users".* FROM "users" INNER JOIN "teams_users" ON "users".id = "teams_users".user_id WHERE ("users"."alias" = 'admire') AND ("teams_users".team_id = 1 ) LIMIT 1
SELECT * FROM "diaries" WHERE ("diaries".user_id = 1 AND ("diaries"."team_id" = 'HelloTeam')) ORDER BY created_at DESC
SELECT * FROM "teams" WHERE ("teams"."id" = 1)
SELECT * FROM "users" INNER JOIN "teams_users" ON "users".id = "teams_users".user_id WHERE ("users"."id" = 1 AND ("teams_users".team_id = 1 ))

  def create
    @diary = Diary.new(params[:diary])
    @diary.user_id = session[:user_id]
    @diary.team_id = session[:team_id]
		@team = Team.find_by_id(session[:team_id])
    respond_to do |format|
      if @diary.save
---
SELECT * FROM "teams" WHERE ("teams"."id" = 1) LIMIT 1
INSERT INTO "diaries" ("team_id", "updated_at", "body", "user_id", "created_at") VALUES(1, '2009-07-26 12:09:48', 'Hello Test Team!!!', 1, '2009-07-26 12:09:48')