app/controllers/diaries_controller.rb

  def index
    @diaries = Diary.all
---
SELECT * FROM "diaries"

  def new
    @diary = Diary.new
		@id = Team.find_by_alias(@_params['id']).id
---
SELECT * FROM "teams" WHERE ("teams"."alias" = 'admireTeams') LIMIT 1