app/controllers/main_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
		if session[:user_id]
		  redirect_to :controller => 'users', :action => User.find(session[:user_id]).alias

SELECT * FROM "users" WHERE ("users"."email" = 'admiresf')
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def login
		if session[:user_id]
			@notice = 'You already login'
			redirect_to :action => 'index'
		else
			session[:user_id] = nil
		  if request.post?
				user_can_login = User.is_can_login? params[:email], params[:password]
				if user_can_login
					session[:user_id] = User.find_id_by_email(params[:email])
          user_alias = User.find_by_id(session[:user_id]).alias