app/controllers/teams_controller.rb

SELECT * FROM "teams"
---
  def index
    @teams = Team.all