app/controllers/teams_users_controller.rb

  def show
    @teams_user = TeamsUser.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def create
    @teams_user = TeamsUser.new(params[:teams_user])
    @teams_user.team_id = session[:team_id]
    @teams_user.user_id = session[:user_id]
    @team = Team.find_by_id(session[:team_id])
    @is_joined = Team.is_user_join? session[:user_id], session[:team_id]
    if @is_joined
      flash[:notice] = 'you already join this team'
      redirect_to :controller => 'teams', :action => @team.alias
    else
      respond_to do |format|
        if @teams_user.save
---
SELECT * FROM "teams" WHERE ("teams"."id" = 3) LIMIT 1
INSERT INTO "teams_users" ("user_id", "team_id") VALUES(1, 1)