app/controllers/teams_controller.rb

  def show
    if @team = Team.find_by_alias(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."alias" = 'admireTeam') LIMIT 1

  def edit
    @team = Team.find_by_alias(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."alias" = 'admireTeam') LIMIT 1

  def create
    @team = Team.new(params[:team])
		@teams_user = TeamsUser.new

    @teams_user.user_id = session[:user_id]
    respond_to do |format|
      if @team.save
        @teams_user.team_id = @team.id
        if @teams_user.save
---
INSERT INTO "teams" ("created_at", "title", "updated_at", "alias", "description") VALUES('2009-07-26 08:39:35', 'Admire_team!!!!!!!!!!!!!', '2009-07-26 08:39:35', 'admireTeam', 'it''s my team !!!')
INSERT INTO "teams_users" ("user_id", "team_id") VALUES(1, 1)