app/controllers/users_controller.rb

SELECT * FROM "teams" INNER JOIN "teams_users" ON "teams".id = "teams_users".team_id WHERE ("teams_users".user_id = 1 )
---
  def show
    @user = User.find_by_id(session[:user_id])
    @teams_user_join = User.find_by_id(session[:user_id]).team