app/controllers/users_controller.rb

SELECT * FROM "users"
---
  def index
    @user = User.all

SELECT * FROM "users" WHERE ("users"."alias" = 'Admire') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def show
    @user = User.find_by_alias(params[:id])
    @new_diary = @user.diaries.find(:all, :order => "created_at DESC")[0]

INSERT INTO "users" ("updated_at", "url", "password_hash", "alias", "email", "created_at") VALUES('2009-07-26 12:09:10', 'http://me2day.net/admire', 'd7e96627a7323d9ba90fcde0346d8cbd87ffe9e1', 'Admire', 'admire9@gmail.com', '2009-07-26 12:09:10')
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if verify_recaptcha(@user)
        if @user.save